Repository: calvinmuller/kazang-pay
Catalog: lib/l10n/app_*.arb
Languages: af, am

source: Account Balance
af: Rekeningbalans
am: የሂሳብ ቀሪ

# accountName
source: Account Name: {name}
af: Rekening Naam: {name}
am: የሂሳብ ስም: {name}

source: Add Cashback
af: Voeg Kontantterug By
am: ጥሬ ገንዘብ መልሶ ይጨምሩ

source: Amount Due
af: Verskuldigde Bedrag
am: የሚገባው መጠን

# app
source: Kazang Pay
am: ካዛንግ ፔይ

source: Approved
af: Goedgekeur
am: ተፈቅዷል

# appType
source: APP
af: TOEP
am: የአፕሊኬሽን ዓይነት

source: Back
af: Terug
am: ወደ ኋላ

# budgetTerm
source: Select a budget term to continue
af: Kies 'n begrotingsterm om voort te gaan
am: የትእዛዝ ጊዜ ይምረጡ

# cancel
source: Cancel Transaction
af: Kanselleer Transaksie
am: ንግድ ይሰረዝ

source: Cancelled
af: Gekanselleer
am: ተሰርዟል

# cancelMessage
source: Your current transaction will be cancelled
af: Jou huidige transaksie sal gekanselleer word
am: የእርስዎ የአሁኑ ልውውጥ ይሰረዛል

# cancelTitle
source: You are about to cancel this transaction
af: Jy staan op die punt om hierdie transaksie te kanselleer
am: የእርስዎ ይህን ልውውጥ ሊሰርዝ ነው

source: Cashback Amount
af: Kontantterugbedrag
am: የካሽባክ መጠን

# checkAnother
source: Check Another Account
af: Kontroleer ‘n Ander Rekening
am: ሌላ አካውንት ይመልከቱ

source: Check Balance
af: Kontroleer Balans
am: ቀሪ ገንዘብን ፍትሹ

# companyWelcome
source: Welcome to {name}
af: Welkom by {name}
am: እንኳን ወደ {name} በደህና መጡ

# continueButton
source: Continue
af: Gaan voort
am: ቀጥል

source: Customer Receipt
af: Kliënt Kwitansie
am: የደንበኛ ደረሰኝ

source: DATE
af: DATUM
am: ቀን

# dateFilter
source: Date
af: Datum
am: ቀን

source: Declined
af: Afgekeur
am: ተቀባይነት አላገኘም

source: Done
af: Gedoen
am: ተጠናቋል

# enterPin
source: Enter Pin To Access Transaction History & Settlements
af: Voer PIN in om toegang tot transaksiegeskiedenis en verrekeninge te verkry
am: የግብይት ታሪክና ክፍያዎችን ለማግኘት ፒን ኮድዎን ያስገቡ።

source: Error
af: Fout
am: ስህተት

# insertOrTap
source: Insert Or Tap Card
af: Steek in of Tik Kaart
am: ካርዱን ያስገቡ ወይም ይንኩ

source: Language
af: Taal
am: ቋንቋ

source: Merchant ID
af: Handelaars-ID
am: የነጋዴ መታወቂያ

source: Merchant Name
af: Handelaarsnaam
am: የነጋዴ ስም

source: Merchant Receipt
af: Handelaarskwitansie
am: የነጋዴ ደረሰኝ

source: New Sale
af: Nuwe Verkoop
am: አዲስ ሽያጭ

source: Ok
am: እሺ

# onboardingRegister
source: Congratulations, you are at the final step of setting up your Kazang Pay Card Reader.
af: Baie geluk, jy is by die laaste stap van die opstel van jou Kazang Pay Kaartleser.
am: እንኳን ደስ አላችሁ፣ የካዛንግ ፔይ ካርድ አንቀሳቃሽዎን ለማቀናበር የመጨረሻውን ደረጃ ደርሳችኋል።

# onboardingWelcome
source: Welcome to Kazang Pay!
af: Welkom by Kazang Pay!
am: እንኳን ወደ ካዛንግ ፔይ በደህና መጡ!

# password
source: Enter Password:
af: Voer Wagwoord in:
am: የይለፍ ቃል ያስገቡ

source: Pay
af: Betaal
am: ክፍያ ይፈጽሙ

source: Pending
af: Hangend
am: በመጠባበቅ ላይ

source: Print
af: Druk
am: አትም ያድርጉ

source: Profile
af: Profiel
am: መገለጫ

source: PURCHASE
af: AANKOOP
am: ግዢ

source: Purchase Amount
af: Koopbedrag
am: የግዢ መጠን

source: REASON
af: REDE
am: ምክንያት

source: Refunded
af: Terugbetaal
am: ተመላሽ

source: Register Device
af: Registreer Toestel
am: መሳሪያን ይመዝግቡ

source: Remove Card
af: Verwyder Kaart
am: ካርዱን ከውስጥ ያውጡ።

source: Reset PIN
af: Herstel PIN
am: ፒን ኮድ ዳግም ያስተካክሉ

source: Retry
af: Probeer weer
am: እንደገና ይሞክሩ

# returnTo
source: Return To Transaction
af: Keer Terug na Transaksie
am: ወደ ግብይት ተመለስ

source: Sale Transaction
af: Verkooptransaksie
am: የሽያጭ ግብይት

# selectAccount
source: Select an account to continue
af: Kies ‘n Rekening om voort te gaan
am: ሂሳብ ይምረጡ

source: Settings
af: Instellings
am: ቅንብሮች

source: Settled
af: Verreken
am: ተከፍሏል

# settlementStatus
source: Status:
am: የክፍያ ሁኔታ

source: Sort By
af: Sorteer Op
am: ቅደም ተከተል

# supervisorPin
source: Please provide your supervisor pin
af: Verskaf asseblief jou toesighouer PIN
am: እባኮትን የአስተዳደር ፒን ያስገቡ

# switchTitle
source: Switch
af: Skakelaar
am: ርዕስ ቀይር

source: TERMINAL ID
af: TERMINAAL-ID
am: ተርሚናል መታወቂያ

source: TIME
af: TYD
am: ሰዓት

source: TOTAL:
af: TOTAAL:
am: ድምር:

source: Transaction History
af: Transaksie Geskiedenis
am: የግብይት ታሪክ

# transactionHistoryTitle
source: Transaction History & Settlements
af: Transaksie Geskiedenis & Verrekeninge
am: የንግድ ታሪክ እና ሰፈሮች

# unexpectedError
source: Unexpected error occurred, please try again.
af: Onverwagte fout het voorgekom, probeer asseblief weer.
am: ያልተጠበቀ ስህተት ተፈጥሯል፣ እባኮትን እንደገና ይሞክሩ።

source: View
af: Bekyk
am: ይመልከቱ

# welcome
source: Good Day
af: Goeie Dag
am: መልካም ቀን

source: Settlement Details
af: Verrekeningsbesonderhede
am: የክፍያ ዝርዝሮች

# settlementHistoryFor
source: Settlement History for {date}
af: Verrekeningsgeskiedenis vir {date}
am: ለ {date} የክፍያ ዝርዝሮች

# settlementSummaryFor
source: Settlement Summary for {date}
af: Verrekeningsopsomming vir {date}
am: ለ {date} የክፍያ ማጠቃለያ

source: Settlements
af: Verrekeninge
am: ክፍያ

# standalone
source: Stand-Alone mode detected.
af: Selfstandige modus opgespoor.
am: ብቻ ሞድ ተገኝቷል

# required
source: This field is required.
af: Hierdie veld is verpligtend.
am: ይህ መስክ ያስፈልጋል።

# serialNumberLengthMax
source: Ensure this field has no more than 14 characters.
af: Verseker dat hierdie veld nie meer as 14 karakters bevat nie.
am: እንደገና ያረጋግጡ ይህ መስክ ከ14 ፊደላት በላይ አይኖርም።

# serialNumberLengthMin
source: Ensure this field has at least 13 characters.
af: Verseker dat hierdie veld minstens 13 karakters bevat.
am: እንደገና ያረጋግጡ ይህ መስክ ከ13 ፊደላት በላይ አይኖርም።

# setPinToProceed
source: Please set a pin to proceed
af: Stel asseblief ‘n PIN in om voort te gaan
am: ለመቀጠል እባክዎ ፒን ኮድ ያዘጋጁ።

source: Send Device Logs
af: Stuur Toestellogs
am: የመሳሪያ ሎጎችን ላክ

# signIn
source: Please provide your login credentials to continue:
af: Verskaf asseblief jou aanmeldbewyse om voort te gaan:
am: እባኮትን ለመቀጠል የመግቢያ መረጃዎን ያስገቡ:

# supervisorPinTitle
source: Supervisor PIN
af: Toesighouer PIN
am: የአስተዳደር ፒን

# terminalIdTitle
source: Terminal ID:
af: Terminaal-ID:
am: የቴርሚናል መለያ

# timeColumn
source: Time:
af: Tyd:
am: የጊዜ አምድ

# pinTooShort
source: PIN must be at least 4 digits long
af: PIN moet ten minste 4 syfers lank wees
am: ፒን ቢያንስ 4 ቁጥር መሆን አለበት

source: Manufacturer:
af: Vervaardiger:
am: አምራች:

source: Model:
am: ሞዴል:

source: Loading Settlements
af: Laai Verrekeninge
am: ክፍያ በመጫን ላይ ነው

source: Profile Information
af: Profielinligting
am: የመገለጫ መረጃ

# loading
source: Loading please wait
af: Laai asseblief, wag...
am: በመጫን ላይ

# updateKeys
source: Updating Keys...
am: ቁልፎችን ማሻሻል

# accountNumber
source: Enter account number:
af: Voer rekeningnommer in:
am: የሂሳብ ቁጥር ያስገቡ:

source: Amount:
af: Bedrag:
am: መጠን:

# batteryLow
source: Battery is too low to transact safely. Please charge your device. {percentage}%
af: Battery is te laag om veilig te transaksioneer. Laai asseblief jou toestel. {percentage}%
am: ባትሪው ለደህንነት ግብይት በጣም ዝቅተኛ ነው። እባኮትን መሳሪያዎን ይሙሉ። {percentage}%

source: Connect POS
af: Koppel POS
am: ፒኦኤስ ያገናኙ

# connectionError
source: Connection error occurred, please try again.
af: Verbindingsfout het voorgekom, probeer asseblief weer.
am: የግንኙነት ስህተት ተፈጥሯል፣ እባኮትን እንደገና ይሞክሩ።

source: Device Serial:
af: Toestel Serienommer:
am: የመሳሪያ ስሪት:

# enterPinAccessSettings
source: Enter PIN To Access Settings
af: Voer PIN in om toegang tot instellings te verkry
am: ቅንብሮችን ለማግኘት ፒን ያስገቡ

# enterSerialNumber
source: Enter Device Serial Number:
af: Voer Toestel Serienommer in:
am: የመሳሪያ ስሪት ቁጥር ያስገቡ:

# incorrectPin
source: Invalid PIN
af: Ongeldige PIN
am: የተሳሳተ ፒን

source: Initialized
af: Geginitialiseer
am: ተጀምሯል

# noOfSettlements
source: Number of Settlements
af: Aantal Verrekeninge
am: ክፍያ ቁጥር

# noOfTransaction
source: Number of Transactions
af: Aantal Transaksies
am: የግብይት ቁጥር

# noPinSet
source: No PIN has been set
af: Geen PIN is opgestel nie
am: ምንም ፒን አልተቀመጠም

source: No settlements found
af: Geen skikkings gevind nie
am: ምንም ክፍያ አልተገኘም

source: No transactions found
af: Geen transaksies gevind nie
am: ምንም ግብይት አልተገኘም

# onboard1
source: You can now accept card payments for any sales on your Kazang device using your very own Kazang Pay device.
af: Jy kan nou kaartbetalings aanvaar vir enige verkope op jou Kazang-toestel met jou eie Kazang Pay-toestel.
am: አሁን በሚወዷት ካዛንግ ፔይ መሳሪያ በመጠቀም በካዛንግ መሳሪያዎ ላይ ላሉ ማንኛውም ሽያጭ የካርድ ክፍያ መቀበል ይችላሉ።

# onboard2
source: You can now top up your Kazang Wallet using your Kazang Pay device, no more trips to the banks and less risk for your business.
af: Jy kan nou jou Kazang Beursie aanvul met jou Kazang Pay-toestel, geen bankbesoeke meer en minder risiko vir jou besigheid.
am: አሁን ከካዛንግ ፔይ መሳሪያዎ በመጠቀም ወደ ካዛንግ ዋሌትዎን መሙላት ይችላሉ። ባንክ መሄድ አያስፈልግም፤ ለንግድዎም አደጋ ዝቅ ያለ ይሆናል።

# onboard3
source: Your card payments will be transferred directly into your Kazang Wallet.
af: Jou kaartbetalings sal direk in jou Kazang Beursie oorgedra word.
am: የካርድ ክፍያዎችዎ በቀጥታ ወደ ካዛንግ ዋሌትዎ ይተላለፋሉ።

# onboardRegisterHelp
source: Please allow the Kazang Sales Agent to assist you with the final step.
af: Laat die Kazang Verkoopsagent jou asseblief help met die laaste stap.
am: እባኮትን የካዛንግ ሽያጭ ወኪሉ በመጨረሻው ደረጃ እንዲረዳዎት ይፍቀዱ።

# passwordError
source: Please enter a password.
af: Voer asseblief ‘n wagwoord in.
am: እባኮትን የይለፍ ቃል ያስገቡ።

# pinLengthError
source: PIN must be 4 digits long
af: PIN moet 4 syfers lank wees
am: ፒን 4 ቁጥር መሆን አለበት

# pinResetSuccess
source: Supervisor PIN reset successfully
af: Toesighouer PIN met sukses herstel
am: የአስተዳደር ፒን በተሳካ ሁኔታ ዳግም ተቀምጧል

# pleaseProvideSupervisorPin
source: Please provide your supervisor pin
af: Verskaf asseblief jou toesighouer PIN
am: እባኮትን የአስተዳደር ፒንዎን ያስገቡ

source: Print Receipt
af: Druk Kwitansie
am: ደረሰኝ ማተም

# printerError
source: Printer error occurred, please check paper and try again.
af: Drukkerfout het voorgekom, kontroleer asseblief die papier en probeer weer.
am: የማተሚያ ስህተት ተፈጥሯል፣ እባኮትን ወረቀት ይፈትሹ እና እንደገና ይሞክሩ።

source: Printing
af: Druk tans
am: በማተም ላይ

source: Proxy Settings
af: Proxy Instellings
am: የፕሮክሲ ቅንብሮች

source: Submit
af: Indien
am: ላክ

source: Total Amount Processed:
af: Totale Bedrag Verwerk:
am: የተሰራ አጠቃላይ መጠን:

source: Total Cashback Amount:
af: Totale Kontantterugbedrag:
am: አጠቃላይ ካሽባክ መጠን:

source: Total Cashback Fees:
af: Totale Kontantterugfooie:
am: አጠቃላይ ካሽባክ ክፍያዎች:

source: Total Fees:
af: Totale Fooie:
am: አጠቃላይ ክፍያዎች:

source: Total Purchase Amount:
af: Totale Aankoopbedrag:
am: አጠቃላይ ግዢ መጠን:

source: Total Purchase Fees:
af: Totale Aankoopfooie:
am: አጠቃላይ ግዢ ክፍያዎች:

source: Total Settlement Amount
af: Totale Verrekeningsbedrag
am: አጠቃላይ ክፍያ መጠን

# totalSettlementAmountCalc
source: * Total Settlement Amount = Total Amount Processed - Total Settlements completed - Fees
af: * Totale Verrekeningsbedrag = Totale Bedrag Verwerk - Totale Verrekeninge voltooi - Fooie
am: * አጠቃላይ ክፍያ መጠን = አጠቃላይ የተሰራ መጠን - አጠቃላይ የተጠናቀቁ ክፍያ - ክፍያዎች

source: Username:
af: Gebruikersnaam:
am: የተጠቃሚ ስም:

# usernameError
source: Please enter a username.
af: Voer asseblief ‘n gebruikersnaam in.
am: እባኮትን የተጠቃሚ ስም ያስገቡ።

# usernameMax
source: Ensure this field has no more than 10 characters.
af: Verseker dat hierdie veld nie meer as 10 karakters bevat nie.
am: እባኮትን ይህ መስክ ከ10 ቁምፊዎች (ፊደላት) በላይ እንዳይሆን ያረጋግጡ።

# usernameMin
source: Ensure this field has at least 10 characters.
af: Verseker dat hierdie veld minstens 10 karakters bevat.
am: እባኮትን ይህ መስክ ቢያንስ 10 ቁምፊዎች (ፊደላት) እንዲኖረው ያረጋግጡ።

source: Version:
af: Weergawe:
am: ስሪት:

source: View More
af: Bekyk Meer
am: ተጨማሪ ይመልከቱ

# voidConfirm
source: You are about to Void this transaction
af: Jy staan op die punt om hierdie transaksie nietig te verklaar
am: ይህንን ግብይት ለመሰረዝ ነዎት

source: Void Transaction
af: Nietigverklaar Transaksie
am: ግብይት ሰርዝ

# switchType
source: SWITCH
af: SKAKEL

source: TRANSSEQNO
af: TRANSSEQNOMMER

# transType
source: TRANTYPE:
af: TRANSAKSIE TIPE:
